# Append Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurveArray..::..Append Method
CurveArray Class See Also
---
Add the curve to the end of the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual void Append(
	Curve item
)
```

Visual Basic
---
```text
Public Overridable Sub Append ( _
	item As Curve _
)
```

Visual C++
---
```text
public:
virtual void Append(
	Curve^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..CurveThe curve to be added.
# See Also
CurveArray Class
Autodesk.Revit.DB Namespace